Documents/Договоры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<Document>
		<Properties>
			<Name>Договоры</Name>
			<BasedOn>
				<xr:Item>Catalog.Контрагенты</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ДействующиеДоговора</xr:Item>
				<xr:Item>InformationRegister.СведенияОДоговорАренды</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Действует</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВЛице</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДопИнфо</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормаДоговора</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ФормаДоговора</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресУстановки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтноситсяКГрупе</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидКонтрагента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПисьменногоДоговора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РайоныУстановкиТерминалов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/ФормаДоговора.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<Enum>
		<Properties>
			<Name>ФормаДоговора</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>УстнаяФорма</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПисьменнаяФорма</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/Договоры/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ПроцедурыФормы

	&НаКлиенте
	Процедура ПриОткрытии(Отказ)
		Объект.Дата = ТекущаяДата();
		Если не Объект.НомерПисьменногоДоговора = "" тогда
			Элементы.НомерПисьменногоДоговора.Видимость = истина;
		КонецЕсли;
	КонецПроцедуры

	&НаКлиенте
	Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
		Если Элементы.НомерПисьменногоДоговора.Видимость = истина и Объект.НомерПисьменногоДоговора = "" тогда
			Отказ = истина;
			Сообщить("Введите № письменного договора аренды");
		Иначе
			Отказ = ложь;
		КонецЕсли;
	КонецПроцедуры

#КонецОбласти

#Область ПроцедурыРеквизитовФормы

	&НаКлиенте
	Процедура КонтрагентПриИзменении(Элемент)
		Объект.ВЛице = КонтрагентПриИзмененииНаСервере(Объект.Контрагент);
	КонецПроцедуры
	
	&НаКлиенте
	Процедура ФормаДоговораПриИзменении(Элемент)
		ФД =Объект.ФормаДоговора;
		Если ФД = ПолучитьПеречисление() тогда
			Элементы.НомерПисьменногоДоговора.Видимость = истина;
		КонецЕсли;
	КонецПроцедуры

#КонецОбласти

#Область НеобходимоПеренести

&НаСервере
Функция КонтрагентПриИзмененииНаСервере(Контрагент)
	Возврат Контрагент.РуководительКонтр;
КонецФункции

//ПеречислениеПисьменнаяФорма
&НаСервере
Функция ПолучитьПеречисление()
	возврат Перечисления.ФормаДоговора.ПисьменнаяФорма;
КонецФункции

#КонецОбласти
